///$$      /$                 /$$             /$$                                               /$$      
//| $$$    /$$                | $$            | $$                                              | $$      
//| $$$$  /$$$  /$$$$$$   /$$$$$$$  /$$$$$$   | $$$$$$$  /$$   /$$   /$$  /$$  /$$  /$$$$$$ | $$$$$$$ 
//| $$ $$/$$ $ |____  $$ /$$__  $$ /$$__  $$  | $$__  $$| $$  | $$  | $$ | $$ | $$ /$$__  $$| $$__  $$
//| $$  $$$| $  /$$$$$$$| $$  | $$| $$$$$$$$  | $$  \ $$| $$  | $$  | $$ | $$ | $$| $$$$$$$$| $$  \ $$
//| $$\  $ | $ /$$__  $$| $$  | $$| $$_____/  | $$  | $$| $$  | $$  | $$ | $$ | $$| $$_____/| $$  | $$
//| $$ \/  | $ | $$$$$$$|  $$$$$$$|  $$$$$$$  | $$$$$$$/|  $$$$$$$  |  $$$$$/$$$$/|  $$$$$$$| $$  | $$
//|__/     |_/ \_______/ \_______/ \_______/  |_______/  \____  $$   \_____/\___/  \_______/|__/  |__/
//                                                             /$$                                          
//                                                            | $$                                       
//                                                             \__                                        

// Ах да, я не супер хороший програмист или как там у вас это называется,
// поэтому все костыли тут это норма, в любом случае буду рад если вы сообщите о проблемах
// мне в ДС megaweh или в моём ДС сервере обхода блокировок YWTeam https://discord.gg/sspJzRsf6x 



function redirect(togo){
    window.location.replace(togo);
    document.location.href=togo
}

